
&НаСервере
Процедура ПерепровестиЗачисления()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пополнение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Пополнение КАК Пополнение";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		СсылкаНаДокумент = Выборка.Ссылка;
	    ДокОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
	Сообщить("Зачисления успешно перепроведены");
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаСервере
Процедура ПерепровестиСписывания()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписываниеБаланса.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписываниеБаланса КАК СписываниеБаланса";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		СсылкаНаДокумент = Выборка.Ссылка;
	    ДокОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
	Сообщить("Списывания успешно перепроведены");
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаСервере
Процедура ПерепровестиТраты()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Покупка.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Покупка КАК Покупка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		СсылкаНаДокумент = Выборка.Ссылка;
	    ДокОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	    ДокОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
	Сообщить("Покупки успешно перепроведены");
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры


&НаКлиенте
Процедура Перепровести(Команда)
	Если Зачисления = Истина Тогда
		ПерепровестиЗачисления();
	КонецЕсли;

	Если СписыванияБаланса = Истина Тогда
		ПерепровестиСписывания();
	КонецЕсли;
	
	Если Траты = Истина Тогда 
		ПерепровестиТраты();	
	КонецЕсли;
	
КонецПроцедуры
