
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Движения.ОстаткиДенег.Записывать = Истина;
	Движение = Движения.ОстаткиДенег.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Категория = КатегорияРасхода;
	Движение.Инициатор = Инициатор;
	Движение.РасчетныйПериод = РасчетныйПериод;
	Движение.Сумма = Сумма;

    Движения.Баланс.Записывать = Истина;
	Движение = Движения.Баланс.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;  
	Движение.РасчетныйПериод = РасчетныйПериод;
	Движение.Инициатор = Инициатор;
	Движение.Сумма = Сумма;
	
	Движения.Подкатегории.Записывать = Истина;
	Движение = Движения.Подкатегории.Добавить();
	Движение.Период = Дата;
	Движение.РасчетныйПериод = РасчетныйПериод;
	Движение.Инициатор = Инициатор;
	Движение.Подкатегория = Подкатегория;
	Движение.Сумма = Сумма;

КонецПроцедуры
                                          