
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.УстановкаЛимитов.Количество() = 0 Тогда
		ЗаполнениеТЧ();
	КонецЕсли;
	ЗаполнениеБаланса();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТЧ()
    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КатегорииРасходов КАК КатегорииРасходов
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорииРасходов.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.УстановкаЛимитов.Добавить();
		НоваяСтрока.Категория = Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеБаланса()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БалансОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Баланс.Остатки КАК БалансОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	БалансДенег = Выборка.СуммаОстаток;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры
