
&НаКлиенте
Процедура РасчетныйПериодПриИзменении(Элемент)
	Объект.ОстатокБаланса = ПолучитьОстатокПоКатегории();
КонецПроцедуры


&НаСервереБезКонтекста 
Функция ПолучитьОстатокПоКатегории()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БалансОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Баланс.Остатки КАК БалансОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОстаток;	
	Иначе
		Возврат 0;	
	КонецЕсли;
КонецФункции