
&НаКлиенте
Процедура РасчетныйПериодПриИзменении(Элемент)
	Объект.ОстатокБаланса = ПолучитьОстатокПоКатегории(Объект.РасчетныйПериод);
КонецПроцедуры


&НаСервереБезКонтекста 
Функция ПолучитьОстатокПоКатегории(РасчетныйПериод)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенегОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ОстаткиДенегОстатки.РасчетныйПериод КАК РасчетныйПериод
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.Остатки(, РасчетныйПериод = &РасчетныйПериод) КАК ОстаткиДенегОстатки";
	Запрос.УстановитьПараметр("РасчетныйПериод", РасчетныйПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОстаток;	
	Иначе
		Возврат 0;	
	КонецЕсли;
КонецФункции