
&НаКлиенте
Процедура Реквизит1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

    ТекущиеДанные = Элементы.Реквизит1.ТекущиеДанные;

    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Закрыть(ТекущиеДанные.Категория);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РасчетныйПериод = ОбщиеПроцедуры.ТекущийРасчётныйПериод();
	Реквизит1.Параметры.УстановитьЗначениеПараметра("РасчетныйПериод", РасчетныйПериод);
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйПериодПриИзменении(Элемент)

    ОбновитьСписокКатегорий();

КонецПроцедуры


&НаСервере
Процедура ОбновитьСписокКатегорий()

    Реквизит1.Параметры.УстановитьЗначениеПараметра(
        "РасчетныйПериод",
        РасчетныйПериод
    );

КонецПроцедуры