
&НаКлиенте
Процедура ТЧПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда

        Элемент.ТекущиеДанные.Дата = Дата;
		Элемент.ТекущиеДанные.НомерПП = ТЧ.Количество();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧПослеУдаления(Элемент)
	
	Нумерация = 1;
	
	Для Каждого Строка Из ТЧ Цикл 
		
		Строка.НомерПП = Нумерация;
		Нумерация = Нумерация + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата = ТекущаяДата();
	РасчетныйПериод = ОбщиеПроцедуры.ТекущийРасчётныйПериод();
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьОстатокПоКатегории(Категория, РасчетныйПериод)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенегОстатки.Категория КАК Категория,
		|	ОстаткиДенегОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.Остатки(
		|			,
		|			РасчетныйПериод = &РасчетныйПериод
		|				И Категория = &Категория) КАК ОстаткиДенегОстатки";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("РасчетныйПериод", РасчетныйПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОстаток;	
	Иначе
		Возврат 0;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПроверкаЗаполненностиТЧ()
	Для Каждого Строка Из ТЧ Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Инициатор) ИЛИ НЕ ЗначениеЗаполнено(Строка.Категория) ИЛИ НЕ ЗначениеЗаполнено(Строка.Подкатегория) ИЛИ НЕ ЗначениеЗаполнено(Строка.Сумма) Тогда
			Возврат Ложь;		
		КонецЕсли;
		
	КонецЦикла;
	Возврат Истина;
КонецФункции



&НаКлиенте
Процедура Провести(Команда)
	Если ПроверкаЗаполненностиТЧ() = Ложь ИЛИ ТЧ.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не все обязательные поля заполнены.");
		Возврат;
	Иначе
		ПроводкаДокумента();
		ЭтаФорма.Закрыть();
	КонецЕсли;	
КонецПроцедуры 

&НаСервере
Процедура ПроводкаДокумента()	
	Для Каждого Строка Из ТЧ Цикл 
		ДокументОбъект = Документы.Покупка.СоздатьДокумент();
		ДокументОбъект.Дата = Строка.Дата;
		ДокументОбъект.Инициатор = Строка.Инициатор;
		ДокументОбъект.КатегорияРасхода = Строка.Категория;
		ДокументОбъект.Сумма = Строка.Сумма;
		ДокументОбъект.Комментарий = Строка.Комментарий;
		ДокументОбъект.Подкатегория = Строка.Подкатегория;
		
		ДокументОбъект.РасчетныйПериод = РасчетныйПериод;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТЧКатегорияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения(
	"ПослеВыбораКатегории",
	ЭтотОбъект
	);
	
	ОткрытьФорму(
	"Справочник.КатегорииРасходов.Форма.ВыборКатегории",
	,
	ЭтотОбъект,
	,
	,
	,
	Оповещение
	);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаток()

	Остаток = ПолучитьОстатокПоКатегории(Элементы.ТЧ.ТекущиеДанные.Категория, РасчетныйПериод);
	Если Остаток = 0 Тогда
		ПоказатьПредупреждение(, "Категория не обнаружена в расчётном периоде или остаток по ней равен нулю.");
		Элементы.ТЧ.ТекущиеДанные.Категория = Неопределено;
		Элементы.ТЧ.ТекущиеДанные.ОстатокПоКатегории = 0;
	Иначе
		Элементы.ТЧ.ТекущиеДанные.ОстатокПоКатегории = Остаток 
	КонецЕсли;


КонецПроцедуры



&НаКлиенте
Процедура ПослеВыбораКатегории(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;
    Элементы.ТЧ.ТекущиеДанные.Категория = Результат;	
    ЗаполнитьОстаток();
КонецПроцедуры








