
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Проведен Тогда
		Объект.РасчетныйПериод = ОбщиеПроцедуры.ТекущийРасчётныйПериод();
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура КатегорияРасходаПриИзмененииНаСервере()
//	// Вставить содержимое обработчика.
//КонецПроцедуры


&НаСервере
Функция ПолучитьКатегорииНаПериод()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЛимитов.Категория КАК Категория
		|ИЗ
		|	Документ.РасчётныйПериод.УстановкаЛимитов КАК УстановкаЛимитов
		|ГДЕ
		|	УстановкаЛимитов.Ссылка = &РасчётныйПериод";
	
	Запрос.УстановитьПараметр("РасчётныйПериод", Объект.РасчетныйПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Массив = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Категория);
	КонецЦикла;
	Возврат Массив;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции


&НаСервереБезКонтекста 
Функция ПолучитьОстатокПоКатегории(Категория, РасчетныйПериод)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенегОстатки.Категория КАК Категория,
		|	ОстаткиДенегОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.Остатки(
		|			,
		|			РасчетныйПериод = &РасчетныйПериод
		|				И Категория = &Категория) КАК ОстаткиДенегОстатки";
	
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("РасчетныйПериод", РасчетныйПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СуммаОстаток;	
	Иначе
		Возврат 0;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ДобавитьСписокТрат(Команда)
	ОткрытьФорму("Обработка.ДобавитьТраты.Форма.Форма");
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КатегорияРасходаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения(
	"ПослеВыбораКатегории",
	ЭтотОбъект
	);
	
	ОткрытьФорму(
	"Справочник.КатегорииРасходов.Форма.ВыборКатегории",
	,
	ЭтотОбъект,
	,
	,
	,
	Оповещение
	);

КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораКатегории(Результат, ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Объект.КатегорияРасхода = Результат;
	ПроверкаКатегории();	

КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКатегории()
	Если НЕ ЗначениеЗаполнено(Объект.РасчетныйПериод) Тогда 
		Возврат;
	КонецЕсли;
	
	КатегорииВПериоде = ПолучитьКатегорииНаПериод();
	
	Если КатегорииВПериоде.Найти(Объект.КатегорияРасхода) <> Неопределено Тогда
		ОстатокПоКатегории = ПолучитьОстатокПоКатегории(Объект.КатегорияРасхода, Объект.РасчетныйПериод);
	Иначе 
		Предупреждение("Категория не найдена в данном расчетном периоде!");
	КонецЕсли;

КонецПроцедуры
