
Функция ТекущийРасчётныйПериод() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчётныйПериод.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасчётныйПериод КАК РасчётныйПериод
		|ГДЕ
		|	РасчётныйПериод.ДатаНачалаПериода <= &ТекущаяДата
		|	И РасчётныйПериод.ДатаКонцаПериода >= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Сообщить("Расчетный период под текущую дату ещё не создан.");
		Возврат Неопределено;	
	КонецЕсли;	
КонецФункции

Функция РасчётныйПериодНаДату(Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчётныйПериод.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасчётныйПериод КАК РасчётныйПериод
		|ГДЕ
		|	РасчётныйПериод.ДатаНачалаПериода <= &НаДату
		|	И РасчётныйПериод.ДатаКонцаПериода >= &НаДату";
	
	Запрос.УстановитьПараметр("НаДату", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Сообщить("Расчетный период под текущую дату ещё не создан.");
		Возврат Неопределено;	
	КонецЕсли;	
КонецФункции

Функция ПолучитьДокументУстановщикЛимита(Период) Экспорт 
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановитьЛимиты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановитьЛимиты КАК УстановитьЛимиты
		|ГДЕ
		|	УстановитьЛимиты.РасчетныйПериод = &РасчетныйПериод";
	
	Запрос.УстановитьПараметр("РасчетныйПериод", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	

КонецФункции	

Функция ПолучитьНачалоСегодня() Экспорт 
	Возврат НачалоДня(ТекущаяДата());
КонецФункции

Функция ПолучитьНачалоДня(Дата) Экспорт 
	Возврат НачалоДня(Дата);
КонецФункции 

Функция ПолучитьКонецДня(Дата) Экспорт 
	Возврат КонецДня(Дата);
КонецФункции

