
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьТЗ();
	ЗаполнитьШапку();
	ЗаполнитьИтоги();
	ЗаполнитьДиаграмму();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИтоги()

    ИтогЛимит = ТЗ.Итог("Лимит");
    ИтогПотрачено = ТЗ.Итог("Потрачено");
    ИтогОстаток = ТЗ.Итог("Остаток");
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьДиаграмму()

	Диаграмма.Очистить();
	
	// Серия "Выделено"
    СерияВыделено = Диаграмма.Серии.Добавить("Выделено");

    // Серия "Осталось"
    СерияОсталось = Диаграмма.Серии.Добавить("Осталось");
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенегОстаткиИОбороты.Категория КАК Категория,
		|	ОстаткиДенегОстаткиИОбороты.СуммаПриход КАК Выделено,
		|	ОстаткиДенегОстаткиИОбороты.СуммаРасход КАК Потрачено,
		|	ОстаткиДенегОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.ОстаткиИОбороты(, , , , РасчетныйПериод = &РасчетныйПериод) КАК ОстаткиДенегОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Выделено УБЫВ";
	
	Запрос.УстановитьПараметр("РасчетныйПериод", РасчётныйПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Категория = точка на горизонтальной оси
        Точка = Диаграмма.УстановитьТочку(Выборка.Категория);

        // Выделено
        Диаграмма.УстановитьЗначение(
            Точка,
            СерияВыделено,
            Выборка.Выделено
        );

        // Осталось
        Диаграмма.УстановитьЗначение(
            Точка,
            СерияОсталось,
            Выборка.Остаток
        );	КонецЦикла;
	
	
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьШапку()
	РасчётныйПериод = ОбщиеПроцедуры.ТекущийРасчётныйПериод();
	ДанныеДляЗаполнения = ПолучитьОстаткиИОбороты();
	ОбщиеТратыЗаПериод = ДанныеДляЗаполнения.Расход;
	ТекущийОстаток = ДанныеДляЗаполнения.Остаток;
	Баланс = ПолучитьБаланс(); 
	ОсталосьВнести = ТекущийОстаток - Баланс;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТЗ()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенегОстаткиИОбороты.Категория КАК Категория,
		|	ОстаткиДенегОстаткиИОбороты.СуммаПриход КАК Выделено,
		|	ОстаткиДенегОстаткиИОбороты.СуммаРасход КАК Потрачено,
		|	ОстаткиДенегОстаткиИОбороты.СуммаКонечныйОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.ОстаткиИОбороты(, , , , РасчетныйПериод = &РасчетныйПериод) КАК ОстаткиДенегОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Выделено УБЫВ";
	
	Запрос.УстановитьПараметр("РасчетныйПериод", ОбщиеПроцедуры.ТекущийРасчётныйПериод());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ТЗ.Очистить();
	Счетчик = 1;	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();  
		НоваяСтрока.Номер = Счетчик;
		Счетчик = Счетчик + 1;
		НоваяСтрока.Категория = Выборка.Категория;
		НоваяСтрока.Лимит = Выборка.Выделено;
		НоваяСтрока.Потрачено = Выборка.Потрачено;
		НоваяСтрока.Остаток = Выборка.Остаток;



	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаланс()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БалансОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.Баланс.Остатки КАК БалансОстатки";	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();
	Возврат Выборка.СуммаОстаток;
КонецФункции

&НаСервере
Функция ПолучитьОстаткиИОбороты()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиДенегОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
		|	ОстаткиДенегОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиДенег.ОстаткиИОбороты(, , , , РасчетныйПериод = &РасчетныйПериод) КАК ОстаткиДенегОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("РасчетныйПериод", ОбщиеПроцедуры.ТекущийРасчётныйПериод());	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Словарь = Новый Структура("Расход, Остаток", Выборка.СуммаРасход, Выборка.СуммаКонечныйОстаток);
	Возврат Словарь;
КонецФункции


&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьТЗ();
	ЗаполнитьШапку();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьРасход(Команда)
	Оповещение = Новый ОписаниеОповещения("ДокументЗакрыт", ЭтотОбъект);
	ОткрытьФорму("Документ.Покупка.ФормаОбъекта",,ЭтотОбъект,,,,Оповещение);
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДокументЗакрыт(Результат, ДополнительныеПараметры) Экспорт 
	ЗаполнитьТЗ();
	ЗаполнитьШапку();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьДоход(Команда)
	ОткрытьФорму("Документ.Пополнение.ФормаОбъекта");
КонецПроцедуры


&НаКлиенте
Процедура Команда1(Команда)
	ОткрытьФорму("Справочник.КатегорииРасходов.Форма.ФормаВыбораСвоя");
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Обновлять данные каждые 30 секунд
	ПодключитьОбработчикОжидания("ОбновитьДанные", 10, Ложь);
	
	// Первоначальное заполнение
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьДанные() Экспорт
	
	ЗаполнитьШапку();
	ЗаполнитьТЗ();
	ЗаполнитьИтоги();
	ЗаполнитьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)

	ОтключитьОбработчикОжидания("ОбновитьДанные");

КонецПроцедуры