
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиДенег Приход
	Движения.ОстаткиДенег.Записывать = Истина;
	Для Каждого ТекСтрокаУстановкаЛимитов Из УстановкаЛимитов Цикл
		Движение = Движения.ОстаткиДенег.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.РасчетныйПериод = ЭтотОбъект.Ссылка;
		Движение.Категория = ТекСтрокаУстановкаЛимитов.Категория;
		Движение.Сумма = ТекСтрокаУстановкаЛимитов.Лимит;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
